In [96]:
import pandas as pd

emp = pd.read_excel(r'C:\Users\imran\Desktop\MyData\Python\emp.xlsx')
#dept = pd.read_excel(r'C:\Users\imran\Desktop\MyData\Python\dept.xlsx')
#incentive = pd.read_excel(r'C:\Users\imran\Desktop\MyData\Python\incen.xlsx')

incentive

   ID  Incentive
0   1        500
1   2        200
2   3        100
3   4        500
4   5        400

In [97]:
m = emp.merge(dept, left_on='Emp_ID', right_on='ID', how = 'right').drop(columns ='ID').reset_index(drop = True)
print(m)

   Emp_ID    Name State       City  Salary    Status Designation Department  \
0       1   imran    JH    Dhanbad    5000    Active     Manager         HR
1       2   hamza    BH       Gaya    8820  Resigned     Manager        MKT
2       3   shama    KA  Bangalore    6987    Active     Manager         IT
3       4  afreen    AS  Dibrigarh    2014    Active   Associate        Fin
4       5   nahid    WB    Asansol    3658    Active       Sales      Sales
5       6   anaya    OR    Cuttack    9874    Active       Sales        Fin
6       7    juhi    PN     Ambala    5456    Active        Lead      Sales
7       8    sonu    UP     Kanpur    1214  Resigned        Head         HR
8       9    monu    MP     Bhopal    3256    Active   Executive        MKT
9      10   tinku    HP      Mandi    5698    Active   Associate         IT

        Dept
0         HR
1      Sales
2  Marketing
3         IT
4         IT
5         IT
6      Sales
7      Sales
8         HR
9      Sales

In [69]:
m.loc[(m['Name'] =='imran')

   Emp_ID   Name Dept
0       1  imran   HR

In [81]:
m1=m.merge(incentive, left_on = 'Emp_ID', right_on = 'ID', how = 'left').drop(columns = 'ID').set_index('Emp_ID')
print(m1)

          Name       Dept  Incentive
Emp_ID
1        imran         HR      500.0
2        hamza      Sales      200.0
3        shama  Marketing      100.0
4       afreen         IT      500.0
5        nahid         IT      400.0
6        anaya         IT        NaN
7         juhi      Sales        NaN
8         sonu      Sales        NaN
9         monu         HR        NaN
10       tinku      Sales        NaN

In [94]:
c=pd.concat([emp,dept],axis=0)
print(c)

   Emp_ID    Name    ID       Dept
0     1.0   imran   NaN        NaN
1     2.0   hamza   NaN        NaN
2     3.0   shama   NaN        NaN
3     4.0  afreen   NaN        NaN
4     5.0   nahid   NaN        NaN
5     6.0   anaya   NaN        NaN
6     7.0    juhi   NaN        NaN
7     8.0    sonu   NaN        NaN
8     9.0    monu   NaN        NaN
9    10.0   tinku   NaN        NaN
0     NaN     NaN   1.0         HR
1     NaN     NaN   2.0      Sales
2     NaN     NaN   3.0  Marketing
3     NaN     NaN   4.0         IT
4     NaN     NaN   5.0         IT
5     NaN     NaN   6.0         IT
6     NaN     NaN   7.0      Sales
7     NaN     NaN   8.0      Sales
8     NaN     NaN   9.0         HR
9     NaN     NaN  10.0      Sales

In [95]:
c=pd.concat([emp,dept],axis=1)
print(c)

   Emp_ID    Name  ID       Dept
0       1   imran   1         HR
1       2   hamza   2      Sales
2       3   shama   3  Marketing
3       4  afreen   4         IT
4       5   nahid   5         IT
5       6   anaya   6         IT
6       7    juhi   7      Sales
7       8    sonu   8      Sales
8       9    monu   9         HR
9      10   tinku  10      Sales

In [107]:
x= emp.pivot_table(index = 'Department', columns = 'Status',values = 'Emp_ID',aggfunc = 'count')
print(x)

Status      Active  Resigned
Department
Fin            2.0       NaN
HR             1.0       1.0
IT             2.0       NaN
MKT            1.0       1.0
Sales          2.0       NaN

In [120]:
x= emp.pivot_table(index = ['Department','Designation'], columns = 'Emp_ID',values = 'Salary',aggfunc=['count','mean','sum'])
print(x)

                       count                                               \
Emp_ID                    1    2    3    4    5    6    7    8    9    10
Department Designation
Fin        Associate     NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN  NaN  NaN
           Sales         NaN  NaN  NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN
HR         Head          NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN  NaN
           Manager       1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
IT         Associate     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0
           Manager       NaN  NaN  1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN
MKT        Executive     NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN
           Manager       NaN  1.0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
Sales      Lead          NaN  NaN  NaN  NaN  NaN  NaN  1.0  NaN  NaN  NaN
           Sales         NaN  NaN  NaN  NaN  1.0  NaN  NaN  NaN  NaN  NaN

                        ...     sum                                          \
Emp_ID                  ...      1       2       3       4       5       6
Department Designation  ...
Fin        Associate    ...     NaN     NaN     NaN  2014.0     NaN     NaN
           Sales        ...     NaN     NaN     NaN     NaN     NaN  9874.0
HR         Head         ...     NaN     NaN     NaN     NaN     NaN     NaN
           Manager      ...  5000.0     NaN     NaN     NaN     NaN     NaN
IT         Associate    ...     NaN     NaN     NaN     NaN     NaN     NaN
           Manager      ...     NaN     NaN  6987.0     NaN     NaN     NaN
MKT        Executive    ...     NaN     NaN     NaN     NaN     NaN     NaN
           Manager      ...     NaN  8820.0     NaN     NaN     NaN     NaN
Sales      Lead         ...     NaN     NaN     NaN     NaN     NaN     NaN
           Sales        ...     NaN     NaN     NaN     NaN  3658.0     NaN


Emp_ID                      7       8       9       10
Department Designation
Fin        Associate       NaN     NaN     NaN     NaN
           Sales           NaN     NaN     NaN     NaN
HR         Head            NaN  1214.0     NaN     NaN
           Manager         NaN     NaN     NaN     NaN
IT         Associate       NaN     NaN     NaN  5698.0
           Manager         NaN     NaN     NaN     NaN
MKT        Executive       NaN     NaN  3256.0     NaN
           Manager         NaN     NaN     NaN     NaN
Sales      Lead         5456.0     NaN     NaN     NaN
           Sales           NaN     NaN     NaN     NaN

[10 rows x 30 columns]

In [122]:
emp.pivot_table(index = 'Department', values ='Salary', aggfunc = 'sum')

            Salary
Department
Fin          11888
HR            6214
IT           12685
MKT          12076
Sales         9114

In [125]:
emp.pivot_table(index = 'Designation', values ='Salary', aggfunc = 'mean')

                  Salary
Designation
Associate    3856.000000
Executive    3256.000000
Head         1214.000000
Lead         5456.000000
Manager      6935.666667
Sales        6766.000000

In [129]:
emp.pivot_table(index = 'Department', columns = 'Status',values ='Emp_ID', aggfunc = 'count', fill_value ='NA')

C:\Users\imran\AppData\Local\Temp\ipykernel_8552\1347830308.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  emp.pivot_table(index = 'Department', columns = 'Status',values ='Emp_ID', aggfunc = 'count', fill_value ='NA')

Status      Active Resigned
Department
Fin              2       NA
HR               1        1
IT               2       NA
MKT              1        1
Sales            2       NA

In [131]:
emp.pivot_table(index = 'Department', columns = 'Designation',values ='Salary', aggfunc = 'sum', fill_value =0, margins =True)

Designation  Associate  Executive  Head  Lead  Manager  Sales    All
Department
Fin               2014          0     0     0        0   9874  11888
HR                   0          0  1214     0     5000      0   6214
IT                5698          0     0     0     6987      0  12685
MKT                  0       3256     0     0     8820      0  12076
Sales                0          0     0  5456        0   3658   9114
All               7712       3256  1214  5456    20807  13532  51977